Tekla Open API Reference for Tekla Structures 2025
PluginPickerInput.AddRange Method
 Appends several picker inputs to the picker input sequence.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddRange(
	List<PickerInput> inputs
)
Public Sub AddRange (
	inputs As List(Of PickerInput)
)
Parameters
inputs
Type: System.Collections.Generic.List<PickerInput>
 All elements of the collection passed in the parameter will be appended in the same order to the plug-in input.
See Also
Reference
PluginPickerInput Class
Tekla.Structures.Drawing Namespace